In [2]:
!dir

 Volume in drive C has no label.
 Volume Serial Number is 96A8-0CF6

 Directory of C:\GD_\USP\DS\4Github\Github\PivotTable

14/08/2021  12:31    <DIR>          .
14/08/2021  12:20    <DIR>          ..
14/08/2021  12:29    <DIR>          .ipynb_checkpoints
14/08/2021  12:31               576 PivotTable.ipynb
               1 File(s)            576 bytes
               3 Dir(s)  45.952.446.464 bytes free

In [6]:
import pandas as pd 
import matplotlib.pyplot as plt 
import numpy as np
import seaborn as sns
import scipy.stats as stats
import statsmodels.stats.api as sms

from IPython.display import display
from IPython.display import Markdown as md
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

pd.set_option('display.max_columns', None)
pd.set_option('display.max_rows', None)

import warnings
warnings.filterwarnings('ignore')

def dp(df, r = 5, c = None):
    from IPython.display import display
    with pd.option_context('display.max_rows', 4, 'display.max_columns', None):
        display(df)

def fg(w = 6, h = 4, dpi = 120):
    plt.rcParams['figure.figsize'] = (w,h)
    plt.rcParams['figure.dpi'] = dpi
fg()

import autotime
%load_ext autoreload
%autoreload 2
%load_ext autotime

The autoreload extension is already loaded. To reload it, use:
  %reload_ext autoreload
The autotime extension is already loaded. To reload it, use:
  %reload_ext autotime
time: 0 ns (started: 2021-08-14 13:17:05 -03:00)

In [4]:
df = pd.read_csv("data.csv")

time: 16 ms (started: 2021-08-14 13:16:29 -03:00)

In [7]:
df

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
0,714466,Trantow-Barrows,Craig Booker,Debra Henley,CPU,1,30000,presented
1,714466,Trantow-Barrows,Craig Booker,Debra Henley,Software,1,10000,presented
2,714466,Trantow-Barrows,Craig Booker,Debra Henley,Maintenance,2,5000,pending
3,737550,Fritsch Russel and Anderson,Craig Booker,Debra Henley,CPU,1,35000,declined
4,146832,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000,won

time: 15 ms (started: 2021-08-14 13:17:08 -03:00)

In [8]:
pd.pivot_table(df, index = 'Name')

                             Account  Price  Quantity
Name
Fritsch Russel and Anderson   737550  35000  1.000000
Kiehn-Spinka                  146832  65000  2.000000
Trantow-Barrows               714466  15000  1.333333

time: 47 ms (started: 2021-08-14 13:17:37 -03:00)

In [34]:
sd = lambda x: np.std(x)
var = lambda x: np.var(x)

time: 0 ns (started: 2021-08-14 13:22:31 -03:00)

In [35]:
pd.pivot_table(df, index = 'Name', aggfunc = ['mean', sd, 'sum'])

                               mean                  <lambda>                \
                            Account  Price  Quantity  Account         Price
Name
Fritsch Russel and Anderson  737550  35000  1.000000        0      0.000000
Kiehn-Spinka                 146832  65000  2.000000        0      0.000000
Trantow-Barrows              714466  15000  1.333333        0  10801.234497

                                           sum
                             Quantity  Account  Price Quantity
Name
Fritsch Russel and Anderson  0.000000   737550  35000        1
Kiehn-Spinka                 0.000000   146832  65000        2
Trantow-Barrows              0.471405  2143398  45000        4

time: 31 ms (started: 2021-08-14 13:22:36 -03:00)